# Pandas

**Pandas is one of the most popular Python libraries for Data Science and Analytics. I like to say it’s the “SQL of Python.”** 

Why? 

Because pandas helps you to manage two-dimensional data tables in Python. Of course, it has many more features.

In [2]:
import numpy as np

import pandas as pd

It’s conventional to refer to ‘pandas’ as ‘pd’. 

When you add the as pd at the end of your import statement, your Jupyter Notebook understands that from this point on every time you type pd, you are actually referring to the pandas library.

# Types of data structures in Pandas

There are two types of data structures in pandas:
* **Series** 

* **DataFrames.**

## Series

**A pandas Series is a one dimensional data structure (“a one dimensional ndarray”) that can store values — and for every value it holds a unique index.**

In [2]:
first_series = pd.Series([1,2,3, np.nan ,"hello"])
first_series

0        1
1        2
2        3
3      NaN
4    hello
dtype: object

In [3]:
series = pd.Series([1,2,3, np.nan ,"hello"], index = ['A','B','C','Unknown','String'])
series
#indexing the Series with custom values

A              1
B              2
C              3
Unknown      NaN
String     hello
dtype: object

In [3]:
dict = {"Python": "Fun", "C++": "Outdated","Coding":"Hmm.."}
series = pd.Series(dict)
series
# Dict to pandas Series

Python         Fun
C++       Outdated
Coding       Hmm..
dtype: object

In [5]:
series[['Coding','Python']]

Coding    Hmm..
Python      Fun
dtype: object

In [6]:
series.index

Index(['Python', 'C++', 'Coding'], dtype='object')

In [7]:
series.values

array(['Fun', 'Outdated', 'Hmm..'], dtype=object)

In [8]:
series.describe()

count            3
unique           3
top       Outdated
freq             1
dtype: object

In [9]:
#Series is a mutable data structures and you can easily change any item’s value: 
series['Coding'] = 'Awesome'
series

Python         Fun
C++       Outdated
Coding     Awesome
dtype: object

In [4]:
# add new values:
series['Java'] = 'Okay'
series

Python         Fun
C++       Outdated
Coding       Hmm..
Java          Okay
dtype: object

In [11]:
# If it is necessary to apply any mathematical operation to Series items, you may done it like below:
num_series = pd.Series([1,2,3,4,5,6,None])
num_series_changed = num_series/2
num_series_changed

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
6    NaN
dtype: float64

In [12]:
# NULL/NaN checking can be performed with isnull() and notnull().
print(series.isnull())
print(num_series.notnull())
print(num_series_changed.notnull())

Python    False
C++       False
Coding    False
Java      False
dtype: bool
0     True
1     True
2     True
3     True
4     True
5     True
6    False
dtype: bool
0     True
1     True
2     True
3     True
4     True
5     True
6    False
dtype: bool

## DataFrames

In [13]:
data = {'year': [1990, 1994, 1998, 2002, 2006, 2010, 2014],
        'winner': ['Germany', 'Brazil', 'France', 'Brazil','Italy', 'Spain', 'Germany'],
        'runner-up': ['Argentina', 'Italy', 'Brazil','Germany', 'France', 'Netherlands', 'Argentina'],
        'final score': ['1-0', '0-0 (pen)', '3-0', '2-0', '1-1 (pen)', '1-0', '1-0'] }
world_cup = pd.DataFrame(data, columns=['year', 'winner', 'runner-up', 'final score'])
world_cup

   year   winner    runner-up final score
0  1990  Germany    Argentina         1-0
1  1994   Brazil        Italy   0-0 (pen)
2  1998   France       Brazil         3-0
3  2002   Brazil      Germany         2-0
4  2006    Italy       France   1-1 (pen)
5  2010    Spain  Netherlands         1-0
6  2014  Germany    Argentina         1-0

In [14]:
# Another way to set a DataFrame is the using of Python list of dictionaries:

data_2 = [{'year': 1990, 'winner': 'Germany', 'runner-up': 'Argentina', 'final score': '1-0'}, 
          {'year': 1994, 'winner': 'Brazil', 'runner-up': 'Italy', 'final score': '0-0 (pen)'},
          {'year': 1998, 'winner': 'France', 'runner-up': 'Brazil', 'final score': '3-0'}, 
          {'year': 2002, 'winner': 'Brazil', 'runner-up': 'Germany', 'final score': '2-0'}, 
          {'year': 2006, 'winner': 'Italy','runner-up': 'France', 'final score': '1-1 (pen)'}, 
          {'year': 2010, 'winner': 'Spain', 'runner-up': 'Netherlands', 'final score': '1-0'}, 
          {'year': 2014, 'winner': 'Germany', 'runner-up': 'Argentina', 'final score': '1-0'}
         ]
world_cup = pd.DataFrame(data_2)
world_cup

  final score    runner-up   winner  year
0         1-0    Argentina  Germany  1990
1   0-0 (pen)        Italy   Brazil  1994
2         3-0       Brazil   France  1998
3         2-0      Germany   Brazil  2002
4   1-1 (pen)       France    Italy  2006
5         1-0  Netherlands    Spain  2010
6         1-0    Argentina  Germany  2014

# Importing Datasets/files


#### Reading:

`df = pd.read_csv("path\to\the\csv\file\for\reading")`
#### Writing:

`df.to_csv("path\to\the\folder\where\you\want\save\csv\file")`


### TXT file(s)
(txt file can be read as a CSV file with other separator (delimiter); we suppose below that columns are separated by tabulation):

#### Reading:

`df = pd.read_csv("path\to\the\txt\file\for\reading", sep='\t')`
#### Writing:

`df.to_csv("path\to\the\folder\where\you\want\save\txt\file", sep='\t')`
### JSON files
(an open-standard format that uses human-readable text to transmit data objects consisting of attribute–value pairs. It is the most common data format used for asynchronous browser/server communication. By its view it is very similar to Python dictionary)

#### Reading:

`df = pd.read_json("path\to\the\json\file\for\reading", sep='\t')`
#### Writing:

`df.to_json("path\to\the\folder\where\you\want\save\json\file", sep='\t')`

### Work with indexes and MultiIndex option

In [6]:
import random
indexes = [random.randrange(0,100) for i in range(5)]
data = [{i:random.randint(0,10) for i in 'ABCDE'} for i in range(5)]
df = pd.DataFrame(data, index=[1,2,3,4,5])
df

    A   B  C  D  E
1  10   9  2  0  1
2   7   9  3  9  2
3   6   4  5  9  3
4   9   7  8  6  3
5   9  10  9  8  2

## Matrix Addition

In [7]:
df = pd.DataFrame({'A':[1,2,3],'B':[-2,-3,-4],"C":[7,8,9]})
dfa = pd.DataFrame({'A':[1,2,3],'D':[6,7,8],"C":[12,12,12]})
dfc = df + dfa
dfc

   A   B   C   D
0  2 NaN  19 NaN
1  4 NaN  20 NaN
2  6 NaN  21 NaN

In [52]:
df.le(dfa)

      A      B     C      D
0  True  False  True  False
1  True  False  True  False
2  True  False  True  False

You can also apply the reductions: `empty`, `any()`, `all()`, and `bool()` to provide a way to summarize a boolean result:

In [53]:
(df<0).all()

A    False
B     True
C    False
dtype: bool

In [54]:
# here horyzontal direction for comparison is taking into account and we check all row’s items
(df < 0).all(axis=1)

0    False
1    False
2    False
dtype: bool

In [55]:
# here vertical direction for comparison is taking into 
# account and we check if just one column’s item satisfies the condition
(df < 0).any()

A    False
B     True
C    False
dtype: bool

In [56]:
# here we check if all DataFrame's items satisfy the condition
(df < 0).any().any()

True

In [57]:
# here we check if DataFrame no one element
df.empty

False

### Descriptive Statistics 


|Function|Description|
|--|-------------------------------|
|abs|absolute value|
|count|number of non-null observations|
|cumsum|cumulative sum (a sequence of partial sums of a given sequence)|
|sum|sum of values|
|mean|mean of values|
|mad|mean absolute deviation|
|median|arithmetic median of values|
|min|minimum value|
|max|maximum value|
|mode|mode|
|prod|product of values|
|std|unbiased standard deviation|
|var|unbiased variance|

In [59]:
print("Sum : ", movies['age'].sum())

Sum :  3089983.0

In [61]:
print(df)

   A  B  C
0  1 -2  7
1  2 -3  8
2  3 -4  9

In [70]:
print("Mean : ")
print(df.mean())

print("\nMean of all Mean Values: ")
print(df.mean().mean())

print("\nMedian: ")
print(df.median())

print("\nStandard Deviation: ")
print(df.std())

print("\nVariance: ")
print(df.var())

print("\nMax: ")
print(df.max())

Mean :
A    2.0
B   -3.0
C    8.0
dtype: float64

Mean of all Mean Values:
2.3333333333333335

Median:
A    2.0
B   -3.0
C    8.0
dtype: float64

Standard Deviation:
A    1.0
B    1.0
C    1.0
dtype: float64

Variance:
A    1.0
B    1.0
C    1.0
dtype: float64

Max:
A    3
B   -2
C    9
dtype: int64

## Function Applications
When you need to make some transformations with some column’s or row’s elements, then method `map` will be helpful (it works like pure Python function `map()` ). But there is also possibility to apply some function to each DataFrame element (not to a column or a row) – method `apply(map)` aids in this case.

### Remember 

The attribute axis define the horizontal `(axis=1)` or vertical direction for calculations `(axis=0)`

### Groupby with Dictionary

In [9]:
d = {'id':[1,2,3],
     'Column 1.1':[14,15,16],
     'Column 1.2':[10,10,10],
     'Column 1.3':[1,4,5],
     'Column 2.1':[1,2,3],
     'Column 2.2':[10,10,10],
}
df = pd.DataFrame(d)
df

   id  Column 1.1  Column 1.2  Column 1.3  Column 2.1  Column 2.2
0   1          14          10           1           1          10
1   2          15          10           4           2          10
2   3          16          10           5           3          10

In [10]:
groupby_dict = {'Column 1.1':'Column 1','Column 1.2':'Column 1','Column 1.3':'Column 1','Column 2.1':'Column 2','Column 2.2':'Column 2'}
df = df.set_index('id')
df=df.groupby(groupby_dict,axis=1).min()
df

    Column 1  Column 2
id
1          1         1
2          4         2
3          5         3

In [11]:
dict = {
    "ID":[1,2,3],
    "Movies":["The Godfather","Fight Club","Casablanca"],
    "Week_1_Viewers":[30,30,40],
    "Week_2_Viewers":[60,40,80],
    "Week_3_Viewers":[40,20,20]
};
df = pd.DataFrame(dict);
df

   ID         Movies  Week_1_Viewers  Week_2_Viewers  Week_3_Viewers
0   1  The Godfather              30              60              40
1   2     Fight Club              30              40              20
2   3     Casablanca              40              80              20

In [12]:
mapping = {"Week_1_Viewers":"Total_Viewers",
           "Week_2_Viewers":"Total_Viewers",
           "Week_3_Viewers":"Total_Viewers",
           "Movies":"Movies"
          }
df = df.set_index('ID')
df=df.groupby(mapping,axis=1).sum()
df

           Movies  Total_Viewers
ID
1   The Godfather            130
2      Fight Club             90
3      Casablanca            140

### Breaking up a String into columns using regex

In [13]:
dict = {'movie_data':['The Godfather 1972 9.2',
                     'Bird Box 2018 6.8',
                     'Fight Club 1999 8.8']
        }
df = pd.DataFrame(dict)
df

               movie_data
0  The Godfather 1972 9.2
1       Bird Box 2018 6.8
2     Fight Club 1999 8.8

In [14]:
df['Name'] = df['movie_data'].str.extract('(\w*\s\w*)', expand=True)
df['Year'] = df['movie_data'].str.extract('(\d\d\d\d)', expand=True)
df['Rating'] = df['movie_data'].str.extract('(\d\.\d)', expand=True)
df

               movie_data           Name  Year Rating
0  The Godfather 1972 9.2  The Godfather  1972    9.2
1       Bird Box 2018 6.8       Bird Box  2018    6.8
2     Fight Club 1999 8.8     Fight Club  1999    8.8

In [15]:
import re

movie_data = ["Name:The Godfather Year: 1972 Rating: 9.2",
              "Name:Bird Box Year: 2018 Rating: 6.8",
              "Name:Fight Club Year: 1999 Rating: 8.8"]
movies={"Name":[],
       "Year":[],
       "Rating":[]}

In [143]:
df = pd.DataFrame(movies)
df

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

### Ranking Rows in Pandas

In [16]:
import pandas as pd

In [17]:
movies = {'Name': ['The Godfather', 'Bird Box', 'Fight Club'],
         'Year': ['1972', '2018', '1999'],
         'Rating': ['9.2', '6.8', '8.8']}
df = pd.DataFrame(movies)
df

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

In [18]:
df['Rating_Rank'] = df['Rating'].rank(ascending=1)
df

            Name  Year Rating  Rating_Rank
0  The Godfather  1972    9.2          3.0
1       Bird Box  2018    6.8          1.0
2     Fight Club  1999    8.8          2.0

In [37]:
df =df.set_index('Rating_Rank')
df

                      Name  Year Rating
Rating_Rank
3.0          The Godfather  1972    9.2
1.0               Bird Box  2018    6.8
2.0             Fight Club  1999    8.8

In [38]:
df.sort_index()

                      Name  Year Rating
Rating_Rank
1.0               Bird Box  2018    6.8
2.0             Fight Club  1999    8.8
3.0          The Godfather  1972    9.2

In [40]:
# Example 2 
import pandas as pd

In [19]:
student_details = {'Name':['Raj','Raj','Raj','Aravind','Aravind','Aravind','John','John','John','Arjun','Arjun','Arjun'],
                   'Subject':['Maths','Physics','Chemistry','Maths','Physics','Chemistry','Maths','Physics','Chemistry','Maths','Physics','Chemistry'],
                   'Marks':[80,90,75,60,40,60,80,55,100,90,75,70]
                
}

df = pd.DataFrame(student_details)
df

       Name    Subject  Marks
0       Raj      Maths     80
1       Raj    Physics     90
2       Raj  Chemistry     75
3   Aravind      Maths     60
4   Aravind    Physics     40
5   Aravind  Chemistry     60
6      John      Maths     80
7      John    Physics     55
8      John  Chemistry    100
9     Arjun      Maths     90
10    Arjun    Physics     75
11    Arjun  Chemistry     70

In [66]:
df['Mark_Rank'] = df['Marks'].rank(ascending=0)
df = df.set_index('Mark_Rank')
df

              Name    Subject  Marks
Mark_Rank
4.5            Raj      Maths     80
2.5            Raj    Physics     90
6.5            Raj  Chemistry     75
9.5        Aravind      Maths     60
12.0       Aravind    Physics     40
9.5        Aravind  Chemistry     60
4.5           John      Maths     80
11.0          John    Physics     55
1.0           John  Chemistry    100
2.5          Arjun      Maths     90
6.5          Arjun    Physics     75
8.0          Arjun  Chemistry     70

In [20]:
df = df.sort_index()
df

       Name    Subject  Marks
0       Raj      Maths     80
1       Raj    Physics     90
2       Raj  Chemistry     75
3   Aravind      Maths     60
4   Aravind    Physics     40
5   Aravind  Chemistry     60
6      John      Maths     80
7      John    Physics     55
8      John  Chemistry    100
9     Arjun      Maths     90
10    Arjun    Physics     75
11    Arjun  Chemistry     70